package hangeunhyeong.boj;

import java.io.*;
/*
전구와 스위치
탐욕해 = 최적해 인 문제
📍1 ~ N번 스위치를 1번부터 N번까지 왼쪽에서 오른쪽으로 순차적으로 누른다고 가정
--------------------------------------
1번 스위치 : 1, 2번 전구에 영향
i번 스위치 : i - 1, i, i + 1번 전구에 영향
N번 스위치 : N - 1, N번 전구에 영향
--------------------------------------
1번 전구 : 1, 2번 스위치에 영향
2번 전구 : 1, 2, 3번 스위치에 영향
3번 전구 : 2, 3, 4번 스위치에 영향
...
N번 전구 : N-1, N번 스위치에 영향
--------------------------------------
🔑 i - 1번 전구는 i번 스위치에 의해 최종상태가 결정됨

1. 1번 스위치를 누를 때와 누르지 않을 때로 분류
2. i번 스위치를 누를지 말지 결정 : i - 1번 전구에 영향을 미칠수 있는 마지막 전구이므로
   i - 1번 전구가 만들고자 하는 상태의 i - 1 전구와 상태가 다른 경우에만 스위치를 누른다
   💡1번 스위치 이후 2 ~ N번 스위치는 각 경우에서 탐욕적으로 진행한 결과만 보면 됨(탐욕해 = 최적해)
3. 2번을 i가 N이 될때까지 반복
4. - 결과값이 만들고자 하는 상태와 같은 경우 : 1번 스위치를 눌렀을 때와 누르지 않았을 때를 비교해서 최솟값을 구함
   - 결과값이 만들고자 하는 상태와 모두 다른 경우 : -1 출력
 */
public class BOJ_2138 {
    public static void main(String[] args) throws IOException {
        BufferedReader br = new BufferedReader(new InputStreamReader(System.in));
        int N = Integer.parseInt(br.readLine());
        String org = br.readLine();
        char[] dst = br.readLine().toCharArray();
        int cnt = 0;    // 스위치를 누른 횟수
        int min = N + 1;
        // 1번 스위치를 누를 때와 누르지 않을때로 분류
        for(int i = 0; i < 2; i++){
            char[] cur = org.toCharArray();
            cnt = i;
            // 스위치를 누른 경우(i == 1)
            if(cnt == 1){
                press(cur, 0);
            }
            // 2 ~ N번 스위치까지 순환하면서 누를지 말지 결정
            for(int j  = 1; j < N; j++){
                if(cur[j - 1] != dst[j - 1]){
                    cnt++;
                    press(cur, j);
//                    System.out.printf("%d press : ", j);
//                    System.out.println(cur);
                }
            }
            // 결과값이 만들고자하는 상태와 같고 누른횟수가 최솟값일때
            if(strcmp(cur, dst) && min > cnt){
                min = cnt;
            }
//            System.out.println("--------------------------");
        }
        // 만들고자하는 상태를 만들 수 없는 경우
        if(min == N + 1)
            min = -1;
        System.out.println(min);

    }
    // idx번 스위치를 누르는 메서드
    public static void press(char[] status, int idx){
        int N = status.length;
        if(idx != 0)
            status[idx - 1] = reverse(status[idx - 1]);
        status[idx] = reverse(status[idx]);
        if(idx + 1 != N)
            status[idx + 1] = reverse(status[idx + 1]);
    }
    public static char reverse(char c){
        return c == '0' ? '1' : '0';
    }
    // 문자열이 같으면 true, 다르면 false 반환
    public static boolean strcmp(char[] str1, char[] str2){
        if(str1.length != str2.length)
            return false;
        int i = 0;
        while(i < str1.length && str1[i] == str2[i]){
            i++;
        }
        return i >= str1.length;
    }
}
